# Project 3 Part 3 - MYSQL DB
Cameron Peace

### Task

***For part 3 of the project you will be practicing applying an E.T.L process on your previously saved movie data. Specifically, you will create a new MySQL database after preparing the data for a relational database. You will export your database to a .sql file in your repository using MySQL Workbench.***

### Assignment

Specifications - Database

Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project, and wants you to create a MySQL database for them.

Specifically, they want the data from the following files included in your database:

* Title Basics:
    * Movie ID (tconst)
    * Primary Title
    * Start Year
    * Runtime (in Minutes)
    * Genres
* Title Ratings
    * Movie ID (tconst)
    * Average Movie Rating
    * Number of Votes
* The TMDB API Results (multiple files)
    * Movie ID
    * Revenue
    * Budget
    * Certification (MPAA Rating)
    
You should normalize the tables as best you can before adding them to your new database.

>**Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).**

>**You only need to keep the imdb_id, revenue, budget, and certification columns**

Required Transformation Steps for Title Basics:

* Normalize Genre:

    * Convert the single string of genres from title basics into 2 new tables.
    * [x] "title_genres": with the columns:

        * tconst
        * genre_id
    * [x] "genres":
        * genre_id
        * genre_name

Discard unnecessary information:

For the title basics table, drop the following columns:

* [x] "original_title" (we will use the primary title column instead)
* [x] "isAdult" ("Adult" will show up in the genres so this is redundant information).
* [x] "titleType" (every row will be a movie).
* [x] "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

Do not include the title_akas table in your SQL database.
You have already filtered out the desired movies using this table and the remaining data is mostly nulls and not of-interest to the stakeholder.

MySQL Database Requirements

* [x] Use sqlalchemy with pandas to execute your SQL queries inside your notebook.

* [x] Create a new database on your MySQL server and call it "movies".

* Make sure to have the following tables in your "movies" database:
    * [x] title_basics
    * [x] title_ratings
    * [x] title_genres
    * [x] genres
    * [x] tmdb_data

* [x] Make sure to set a Primary Key for each table that isn't a joiner table (e.g. title_genres is a joiner table).

* [x] After creating each table, show the first 5 rows of that table using a SQL query.

* [x] Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

Deliverables
Submit a link to your github respository containing the Jupyter Notebook file.

### Imports

In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.types import *

### Loading, Viewing Data

In [2]:
# loading data
basics = pd.read_csv('Data/title_basics.csv.gz')
ratings = pd.read_csv('Data/title_ratings.csv.gz')

In [3]:
# initial view
display(basics.head(), ratings.head())

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

      tconst  averageRating  numVotes
0  tt0000001            5.7      1960
1  tt0000002            5.8       263
2  tt0000005            6.2      2597
3  tt0000006            5.1       178
4  tt0000007            5.4       816

### Adjusting column names

In [4]:
# adjusting column names to snake_case
def column_fixer(columns):
    new_columns = []
    for col in columns:
        new_col = ''
        for i in col:
            if i.isupper():
                new_col += '_' + i.lower()
            else:
                new_col += i
        new_columns.append(new_col)
    return new_columns

# using function
basics.columns = column_fixer(basics.columns)
ratings.columns = column_fixer(ratings.columns)

# confirming
display(basics.columns, ratings.columns)

Index(['tconst', 'title_type', 'primary_title', 'original_title', 'is_adult',
       'start_year', 'end_year', 'runtime_minutes', 'genres'],
      dtype='object')

Index(['tconst', 'average_rating', 'num_votes'], dtype='object')

## Create All DB Tables

### Split & Explode 'genres'

In [5]:
# creating a separate column with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')

# confirming
basics.head(2)

,tconst,title_type,primary_title,original_title,is_adult,start_year,end_year,runtime_minutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]

In [6]:
# exploding genres_split
exploded_genres = basics.explode('genres_split')

# checking the new df
exploded_genres.head()

,tconst,title_type,primary_title,original_title,is_adult,start_year,end_year,runtime_minutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama

### Create list of unique genres

In [7]:
# save a list of unique genres
genre_list = sorted(exploded_genres['genres_split'].unique())

# checking
print(genre_list)

['Action', 'Adult', 'Adventure', 'Animation', 'Biography', 'Comedy', 'Crime', 'Drama', 'Family', 'Fantasy', 'Game-Show', 'History', 'Horror', 'Music', 'Musical', 'Mystery', 'News', 'Reality-TV', 'Romance', 'Sci-Fi', 'Short', 'Sport', 'Talk-Show', 'Thriller', 'War', 'Western']

### Create title_genres table

In [8]:
# creating new table
title_genres = exploded_genres[['tconst', 'genres_split']].copy()

# checking
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [9]:
# creating a genre index
genre_ints = range(len(genre_list))
genre_map = dict(zip(genre_list, genre_ints))

# checking
print(genre_map)

{'Action': 0, 'Adult': 1, 'Adventure': 2, 'Animation': 3, 'Biography': 4, 'Comedy': 5, 'Crime': 6, 'Drama': 7, 'Family': 8, 'Fantasy': 9, 'Game-Show': 10, 'History': 11, 'Horror': 12, 'Music': 13, 'Musical': 14, 'Mystery': 15, 'News': 16, 'Reality-TV': 17, 'Romance': 18, 'Sci-Fi': 19, 'Short': 20, 'Sport': 21, 'Talk-Show': 22, 'Thriller': 23, 'War': 24, 'Western': 25}

In [10]:
# changing 'genres_split' to 'genre_id' with a map function
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)

# checking
title_genres.head(3)

      tconst genres_split  genre_id
0  tt0035423       Comedy         5
0  tt0035423      Fantasy         9
0  tt0035423      Romance        18

In [11]:
# dropping 'genres_split'
title_genres = title_genres.drop(columns='genres_split').copy()

title_genres.head(3)

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18

### Create genres table

In [12]:
# creating a lookup table for genre
genres = pd.DataFrame({'genre_name':genre_map.keys(), 
                      'genre_id': genre_map.values()})

# checking
genres

    genre_name  genre_id
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Short        20
21       Sport        21
22   Talk-Show        22
23    Thriller        23
24         War        24
25     Western        25

### Create 'tmdb_data' table

In [13]:
# creating a list of files to read into a df
tmdb_list = ["tmdb_api_results_2000.json", "tmdb_api_results_2001.json",  
"tmdb_api_results_2002.json", "tmdb_api_results_2003.json",   
"tmdb_api_results_2004.json",   "tmdb_api_results_2005.json",   
"tmdb_api_results_2006.json",   "tmdb_api_results_2007.json",   
"tmdb_api_results_2008.json",   "tmdb_api_results_2009.json",   
"tmdb_api_results_2010.json",   "tmdb_api_results_2011.json",
"tmdb_api_results_2012.json",   "tmdb_api_results_2013.json",   
"tmdb_api_results_2014.json",   "tmdb_api_results_2015.json",   
"tmdb_api_results_2016.json",   "tmdb_api_results_2017.json",   
"tmdb_api_results_2018.json",   "tmdb_api_results_2019.json",   
"tmdb_api_results_2020.json",   "tmdb_api_results_2021.json",   
"tmdb_api_results_2022.json"]

In [14]:
# reading in data
tmdb_data = pd.DataFrame()
for file in tmdb_list:
    try:
        _df = pd.read_json('Data/' + file)
        tmdb_data = pd.concat((tmdb_data, _df), ignore_index=True)
    except Exception as e:
        print('Error',  file, e)

In [15]:
# checking
display(tmdb_data.head(), tmdb_data.info(), tmdb_data.columns)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65872 entries, 0 to 65871
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                65872 non-null  object
 1   adult                  65849 non-null  float64
 2   backdrop_path          42667 non-null  object
 3   belongs_to_collection  4351 non-null   object
 4   budget                 65849 non-null  float64
 5   genres                 65849 non-null  object
 6   homepage               65849 non-null  object
 7   id                     65849 non-null  float64
 8   original_language      65849 non-null  object
 9   original_title         65849 non-null  object
 10  overview               65849 non-null  object
 11  popularity             65849 non-null  float64
 12  poster_path            60795 non-null  object
 13  production_companies   65849 non-null  object
 14  production_countries   65849 non-null  object
 15  release_date           65849 non-null  object
 16  revenue                65849 non-null  float64
 17  runtime                65849 non-null  float64
 18  spoken_languages       65849 non-null  object
 19  status                 65849 non-null  object
 20  tagline                65849 non-null  object
 21  title                  65849 non-null  object
 22  video                  65849 non-null  float64
 23  vote_average           65849 non-null  float64
 24  vote_count             65849 non-null  float64
 25  certification          39183 non-null  object
dtypes: float64(9), object(17)
memory usage: 13.1+ MB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,None,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.50,22.0,
2,tt0113092,0.0,None,None,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.10,8.0,
3,tt0116391,0.0,None,None,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,,Gang,0.0,4.00,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,None,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.11,2162.0,PG

None

Index(['imdb_id', 'adult', 'backdrop_path', 'belongs_to_collection', 'budget',
       'genres', 'homepage', 'id', 'original_language', 'original_title',
       'overview', 'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'video',
       'vote_average', 'vote_count', 'certification'],
      dtype='object')

In [16]:
# limiting columns per directions
tmdb_data = tmdb_data[['imdb_id', 'revenue', 'budget', 'certification']].copy()

# dropping 1st row (leftover from data collection)
tmdb_data = tmdb_data.drop(0).copy()

# confirming
tmdb_data.head()

     imdb_id     revenue      budget certification
1  tt0113026         0.0  10000000.0
2  tt0113092         0.0         0.0
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG
5  tt0118852         0.0         0.0             R

## Dropping unneeded columns

In [17]:
# dropping unnecessary columns
basics = basics.drop(columns=['title_type', 'original_title', 'is_adult', 
                              'end_year', 'genres', 'genres_split' ]).copy()

# checking
basics.head()

,tconst,primary_title,start_year,runtime_minutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [18]:
# taking another look at the other tables
display(ratings.head(3), title_genres.head(3), genres.head(3), tmdb_data.head(3))

      tconst  average_rating  num_votes
0  tt0000001             5.7       1960
1  tt0000002             5.8        263
2  tt0000005             6.2       2597

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2

     imdb_id  revenue      budget certification
1  tt0113026      0.0  10000000.0
2  tt0113092      0.0         0.0
3  tt0116391      0.0         0.0           NaN

<mark><u>**Comment:**</u>

<font color='dodgerblue' size=4><i>
It looks like all of our tables are correct, I'll now create the database.
</i></font>

### Dropping duplicates for tmdb_data

In [19]:
# checking shape
display(tmdb_data.shape, tmdb_data['imdb_id'].nunique())

(65871, 4)

65850

In [20]:
# checking
tmdb_data.duplicated().sum()

# dropping duplicates
tmdb_data = tmdb_data.drop_duplicates().copy()

# confirming
tmdb_data.duplicated().sum()

0

## Create the Database + Schema

### Set up connection, Create 'movies' db

In [21]:
# accessing password in a secure manner
my_pass = ''
with open('Data/sqlpass.txt', 'r') as f:
    my_pass = f.read()

In [22]:
# creating db connection
engine = create_engine(f'mysql+pymysql://root:{my_pass}@localhost')

# confirming
engine

Engine(mysql+pymysql://root:***@localhost)

In [23]:
# create database
with engine.connect() as connect:
    connect.execute('CREATE DATABASE IF NOT EXISTS movies')

In [24]:
# updating engine
engine = create_engine(f'mysql+pymysql://root:{my_pass}@localhost/movies')

# confirming
engine

Engine(mysql+pymysql://root:***@localhost/movies)

### Creating Schema Dictionary

In [25]:
# display all column names
display(basics.columns, ratings.columns, title_genres.columns, 
        genres.columns, tmdb_data.columns)

Index(['tconst', 'primary_title', 'start_year', 'runtime_minutes'], dtype='object')

Index(['tconst', 'average_rating', 'num_votes'], dtype='object')

Index(['tconst', 'genre_id'], dtype='object')

Index(['genre_name', 'genre_id'], dtype='object')

Index(['imdb_id', 'revenue', 'budget', 'certification'], dtype='object')

In [26]:
# calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primary_title'].fillna('').map(len).max()
genre_name_len = genres['genre_name'].fillna('').map(len).max()
certification_len = tmdb_data['certification'].fillna('').map(len).max()

# create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    'tconst': String(key_len+1), 'primary_title': Text(title_len+1),
    'start_year': Float(), 'runtime_minutes': Integer(),
    'average_rating': Float(), 'num_votes': Integer(),
    'genre_id': Integer(), 'genre_name': Text(genre_name_len+1),
    'imdb_id': String(key_len+1), 'revenue': Float(),
    'budget': Float(), 'certification': Text(certification_len+1)
}

### Creating SQL Tables

In [27]:
# creating tables
basics.to_sql('title_basics', engine, dtype=df_schema, if_exists='replace', index=False)
ratings.to_sql('title_ratings', engine, dtype=df_schema, if_exists='replace', index=False)
title_genres.to_sql('title_genres', engine, dtype=df_schema, if_exists='replace', index=False)
genres.to_sql('genres', engine, dtype=df_schema, if_exists='replace', index=False)
tmdb_data.to_sql('tmdb_data', engine, dtype=df_schema, if_exists='replace', index=False);

In [28]:
# setting primary keys
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`)')
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`)')
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`)')
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`)')

### Confirming Table Creation

In [29]:
q = 'select * from title_basics limit 5'
pd.read_sql(q, engine)

,tconst,primary_title,start_year,runtime_minutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [30]:
q = 'select * from title_ratings limit 5'
pd.read_sql(q, engine)

      tconst  average_rating  num_votes
0  tt0000001             5.7       1960
1  tt0000002             5.8        263
2  tt0000005             6.2       2597
3  tt0000006             5.1        178
4  tt0000007             5.4        816

In [31]:
q = 'select * from title_genres limit 5'
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [32]:
q = 'select * from genres limit 5'
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [36]:
q = 'select * from tmdb_data limit 5'
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0          0         NaN         NaN          None
1  tt0035423  76019000.0  48000000.0         PG-13
2  tt0062336         0.0         0.0          None
3  tt0069049         0.0  12000000.0             R
4  tt0088751         0.0    350000.0

## Show All Tables

In [34]:
q = 'show tables'
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

<mark><u>**Comment:**</u>

<font color='dodgerblue' size=4><i>
It appears that all of the tables made it into the database.  After double checking the database with MySQL Workbench, it also appears the primary keys were set.
</i></font>